Revit 2027 API
Face.HasRegions Property
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasRegions { get; }
Public ReadOnly Property HasRegions As Boolean
	Get
public:
property bool HasRegions {
	bool get ();
}
member HasRegions : bool with get
Property Value
Boolean
Remarks
If this is true, use GetRegions() to get access to the specific Faces which make up the regions.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace